Runback Final/Final_M3_Cav1/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 1;

vertices
(
    // lower z = -0.05
    (0 1.2 -0.05)  // 0
    (0 4 -0.05)  // 1
    (1 4 -0.05) // 2
    (1 1.2 -0.05) // 3 
    (1 0 -0.05) // 4 
    (3.6 0 -0.05) // 5 
    (3.6 1.2 -0.05) // 6 
    (8 1.2 -0.05) // 7 
    (8 4 -0.05) // 8
    (3.6 4 -0.05) // 9 

    // upper z = +0.05
    (0 1.2 0.05)  // 10
    (0 4 0.05)  // 11
    (1 4 0.05) // 12
    (1 1.2 0.05) // 13 
    (1 0 0.05) // 14 
    (3.6 0 0.05) // 15 
    (3.6 1.2 0.05) // 16 
    (8 1.2 0.05) // 17 
    (8 4 0.05) // 18
    (3.6 4 0.05) // 19 
);

blocks
(
    hex (0 3 2 1 10 13 12 11) (384 128 1) simpleGrading (1 1 1)
    hex (3 6 9 2 13 16 19 12) (192 128 1) simpleGrading (1 1 1)
    hex (4 5 6 3 14 15 16 13) (192 64 1) simpleGrading (1 1 1)
    hex (6 7 8 9 16 17 18 19) (384 128 1) simpleGrading (1 1 1)
);

edges
(
); 

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 11 10) 
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 8 18 17) 
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (4 5 15 14)
        );

    }
    top
    {
        type symmetryPlane;
        faces
        (
            (1 2 12 11)
            (2 9 19 12)
            (9 8 18 19) 
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (0 3 13 10)
            (4 3 13 14)
            (6 7 17 16) 
            (5 6 16 15)
        );
    }
    front
    {
        type  empty;
        faces
        (
            // lower-z faces of each hex
            (0 3 2 1)
            (3 6 9 2)
            (4 5 6 3)
            (6 7 8 9)
        );
    }

    back
    {
        type  empty;
        faces
        (
            // upper-z faces of each hex
            (10 13 12 11)
            (13 16 19 12)
            (14 15 16 13)
            (16 17 18 19)
        );
    }
);

mergePatchPairs
(
);


